:PROPERTIES:
:ID:       9174b126-1816-4501-8f17-2ad630b148ce
:END:
#+TITLE: Guix: Find which profiles contain a file or package
#+CATEGORY: slips
#+TAGS:

*** Error

Elfeed just doesn't update and shows some error =60=, which I see in the
=*elfeed-log*=. I trace it back to this. Elfeed is swallowing the errors, so
debugging would only help if you step through ... which I guess I really should
be doing.

#+begin_example emacs-lisp
(defcustom elfeed-use-curl
  (not (null (executable-find elfeed-curl-program-name)))
  "If non-nil, fetch feeds using curl instead of `url-retrieve'."
  :group 'elfeed
  :type 'boolean)
#+end_example

So in my session, this is the path elfeed is trying to read from.

#+begin_src emacs-lisp
(executable-find elfeed-curl-program-name)
#+end_src

#+RESULTS:
: /gnu/store/b727ryyfiz1cfdywjp8s1wmxd6lzsz8p-curl-7.85.0/bin/curl

When I run curls manually with this.

#+begin_quote
/gnu/store/b727ryyfiz1cfdywjp8s1wmxd6lzsz8p-curl-7.85.0/bin/curl --verbose https://https://valdyas.org/fading/feed/

% Total    % Received % Xferd  Average Speed   Time    Time     Time  Current
                                 Dload  Upload   Total   Spent    Left  Speed
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0*   Trying 159.69.155.203:443...
Trying 2a01:4f8:c2c:b39::1:443...
Immediate connect fail for 2a01:4f8:c2c:b39::1: Network is unreachable
Connected to valdyas.org (159.69.155.203) port 443 (#0)
GnuTLS ciphers: NORMAL:-ARCFOUR-128:-CTYPE-ALL:+CTYPE-X509:-VERS-SSL3.0
ALPN: offers h2
ALPN: offers http/1.1
SSL connection using TLS1.2 / ECDHE_RSA_AES_256_GCM_SHA384
server certificate verification failed. CAfile: none CRLfile: none
  0     0    0     0    0     0      0      0 --:--:-- --:--:-- --:--:--     0
Closing connection 0

curl: (60) server certificate verification failed. CAfile: none CRLfile: none
More details here: https://curl.se/docs/sslcerts.html

curl failed to verify the legitimacy of the server and therefore could not
establish a secure connection to it. To learn more about this situation and
how to fix it, please visit the web page mentioned above.

#+end_quote

i'm guessing the certificate store is bundled into the curl binary.

#+begin_src sh :results verbatim
/gnu/store/b727ryyfiz1cfdywjp8s1wmxd6lzsz8p-curl-7.85.0/bin/curl-config --cc
/gnu/store/b727ryyfiz1cfdywjp8s1wmxd6lzsz8p-curl-7.85.0/bin/curl-config --ca
/gnu/store/b727ryyfiz1cfdywjp8s1wmxd6lzsz8p-curl-7.85.0/bin/curl-config --prefix
#+end_src

#+RESULTS:
: gcc
:
: /gnu/store/b727ryyfiz1cfdywjp8s1wmxd6lzsz8p-curl-7.85.0

Strings doesn't clarify much that =curl-config= hasn't already yielded.

#+begin_example sh
strings /gnu/store/b727ryyfiz1cfdywjp8s1wmxd6lzsz8p-curl-7.85.0/bin/curl
#+end_example

Other curl binaries on the system give pretty typical results

*** Guix profile

So there's not much in the package dependency.

#+begin_src sh :results verbatim
tree -L 3 /gnu/store/p38l5rwmrwwf41w314ab10ffkcl1lz47-emacs-elfeed-org-0.1-1.77b6bbf/
#+end_src

#+RESULTS:
: /gnu/store/p38l5rwmrwwf41w314ab10ffkcl1lz47-emacs-elfeed-org-0.1-1.77b6bbf/
: └── share
:     └── emacs
:         └── site-lisp
:
: 4 directories, 0 files

But it's not in this profile. I only have a few Guix profiles on this
system. About 4 + the system/user profiles. Curl isn't propgated in any of them
and it's not in the path.

#+begin_src sh :results output
ls -la ~/.guix-extra-profiles/emacs-g/emacs-g/bin | grep curl | wc -l
#+end_src

#+RESULTS:
: 0

